## Import Pandas/Numpy

In [2]:
import pandas as pd
import numpy as np

## DataFrame

In [ ]:
pdf = pd.DataFrame
df = pdf([[1, 2, 3], [3, 2, 1], [4, 5, 6]])

In [18]:
df

   0  1  2
0  1  2  3
1  3  2  1
2  4  5  6

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       3 non-null      int64
 2   2       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

In [24]:
df.describe()

              0         1         2
count  3.000000  3.000000  3.000000
mean   2.666667  3.000000  3.333333
std    1.527525  1.732051  2.516611
min    1.000000  2.000000  1.000000
25%    2.000000  2.000000  2.000000
50%    3.000000  2.000000  3.000000
75%    3.500000  3.500000  4.500000
max    4.000000  5.000000  6.000000

In [25]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [26]:
df.nunique()

0    3
1    2
2    3
dtype: int64

In [27]:
df.index.tolist()

[0, 1, 2]

In [28]:
df.columns.tolist()

[0, 1, 2]

In [30]:
df[1].tolist()

[2, 2, 5]

## Load DF from Files

In [31]:
coffee = pd.read_csv("./warmup-data/coffee.csv")

In [39]:
bios = pd.read_csv("./data/bios.csv")

In [40]:
## To read an excel spreadsheet
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name="results")

In [34]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 468.0+ bytes

In [38]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

## Filtering

In [41]:
bios.loc[bios["height_cm"] == 135]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
4505,4520,Peter Ayesu,1962-06-01,NaN,NaN,NaN,Malawi,135.0,51.0,NaN
28762,28976,Choi Myong-Hui,1966-06-13,NaN,NaN,NaN,Democratic People's Republic of Korea,135.0,25.0,NaN
101552,102450,Jana Labáková,1966-01-26,Detva,Banská Bystrica,SVK,Czechoslovakia,135.0,34.0,NaN

In [43]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25